app/controllers/accounts_controller.rb

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
      @account = Account.find params[:id]

INSERT INTO "accounts" ("gender", "email", "password_digest", "firstname", "lastname", "middlename", "country", "state", "city", "street", "zip", "homephone", "cellphone", "DOB") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @account = Account.new(account_params)
    @cellphone_number = @account.cellphone.gsub(/\D/, '')
    @homephone_number = @account.homephone.gsub(/\D/, '')
    if @cellphone_number.length == 10   #change homephone format to xxx-xxx-xxxx
        @account.cellphone = correct_phone_format(@cellphone_number)
    end

    if @homephone_number.length == 10   #change homephone format to xxx-xxx-xxxx
        @account.homephone = correct_phone_format(@homephone_number)
    end

   # @account.DOB = @account.DOB.to_s.gsub(/^(\d{2})-(\d{2})-(\d{4})/, '\3-\1-\2') #change DOB format to yyyy-mm-dd
     correct_DOB_format(@account)

    if @account.save

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", 5]]
---
  def profiles
      if logged_in
        @account = Account.find(session[:id])

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", 1]]
---
  def application

      if logged_in
      @account = Account.find(session[:id])

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", 1]]
---
  def viewapplication
    if session[:id]
      @account = Account.find(session[:id])

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "accounts" SET "is_former_worker" = ?, "is_current_worker" = ?, "related_to_councilmember" = ?, "has_convictions" = ?, "need_accommodations" = ? WHERE "accounts"."id" = ?  [["is_former_worker", "f"], ["is_current_worker", "f"], ["related_to_councilmember", "f"], ["has_convictions", "f"], ["need_accommodations", "f"], ["id", 1]]
SELECT  "related_councilmembers".* FROM "related_councilmembers" WHERE "related_councilmembers"."account_id" = ? LIMIT 1  [["account_id", 1]]
SELECT  "user_formerworkers".* FROM "user_formerworkers" WHERE "user_formerworkers"."account_id" = ? LIMIT 1  [["account_id", 1]]
---
  def update


     @account = Account.find(session[:id])
     @my_update_hash = account_update_params

     if @account.submit_bcheck == false&&@account.status== nil ||admin_logged_in

        if(params[:account][:is_former_worker] == "1")
          @account.user_formerworker ||= UserFormerworker.new
        else
          @account.user_formerworker ||= UserFormerworker.new
          @account.update(:is_former_worker => "0")
          if params[:account].has_key?(:user_formerworker_attributes)
              @my_update_hash[:user_formerworker_attributes][:date_of_employment] = "1999-3-8"
              @my_update_hash[:user_formerworker_attributes][:reason_for_leaving] = "none"
              @my_update_hash[:user_formerworker_attributes][:position_or_department] = "none"
          end
        end

        if(params[:account][:related_to_councilmember] == "1")
          if params[:account][:related_councilmember_attributes].nil?
            @account.related_councilmember ||= RelatedCouncilmember.new
          elsif params[:account][:related_councilmember_attributes][:name].nil?
            #flash[:notice] = 'Please check one CM'
            flash[:warning] = ["council memeber name is blank"];
            redirect_to profiles_path  and return #:id => @account.id
          else
            @account.related_councilmember ||= RelatedCouncilmember.new
            @account.related_councilmember.name = params[:account][:related_councilmember_attributes][:name].join(' ')

DELETE FROM "user_formerworkers" WHERE "user_formerworkers"."id" = ?  [["id", 1]]
---

        if(params[:account][:is_former_worker] == "0")
            if(@account.user_formerworker != nil)
                @account.user_formerworker.destroy

DELETE FROM "related_councilmembers" WHERE "related_councilmembers"."id" = ?  [["id", 1]]
---
        end
        if(params[:account][:related_to_councilmember] == "0")
          if @account.related_councilmember != nil
              @account.related_councilmember.destroy

DELETE FROM "current_workers" WHERE "current_workers"."id" = ?  [["id", 1]]
---
        end
        if(params[:account][:is_current_worker] == "0")
          if @account.current_worker != nil
              @account.current_worker.destroy

DELETE FROM "former_criminals" WHERE "former_criminals"."id" = ?  [["id", 1]]
---
        end
        if(params[:account][:has_convictions] == "0")
          if @account.former_criminal != nil
              @account.former_criminal.destroy

DELETE FROM "accommodations" WHERE "accommodations"."id" = ?  [["id", 1]]
---
        end
        if(params[:account][:need_accommodations] == "0")
          if @account.accommodation != nil
              @account.accommodation.destroy

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "accounts" SET "submit_bcheck" = 't' WHERE "accounts"."id" = ?  [["id", 1]]
---
  def save_and_submit
      @account = Account.find(session[:id])
      if @account.submit_bcheck == false && @account.status == nil      #if never submit, then save and submit
          if @account.update_columns(submit_bcheck: true)

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", 1]]
---
  def save_change
      @account = Account.find(session[:id])

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."email" = ? LIMIT 1  [["email", ""]]
---
  def input_your_email
      if params[:email]
        @account = Account.find_by(email: params[:email])

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", 1]]
---
  def resend_your_email
     @account = Account.find(session[:id])

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", nil]]
---
  def reset_your_password
     @account = Account.find(session[:id])

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "accounts" SET "password_digest" = ? WHERE "accounts"."id" = ?  [["password_digest", "$2a$10$HgefZvt61pu9fXxYBlfiSuKIHIEJ0mh2Ltc8TdQsjC4cWhaRHpBt."], ["id", 2]]
---
   def save_password_change
      @account = Account.find(session[:id])

       if (params[:account][:password] == params[:account][:password_confirmation])
          if validate_password(params[:account][:password])
             @account.password = params[:account][:password]
             if @account.save