app/controllers/admins_controller.rb

  def edit
      @admin = Admin.find params[:id]
---
SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT 1  [["id", 2]]

  def create
    @admin = Admin.new(admin_params)
      if @admin.save
---
INSERT INTO "admins" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "123"], ["password_digest", "$2a$10$VmOUaZbKc/1lWeQxACPRTOCXN3kkcF4pXH8Ce6222j4lI5UWssz0q"], ["created_at", "2016-03-29 03:37:28.413396"], ["updated_at", "2016-03-29 03:37:28.413396"]]

  def show
    #verify user logged in
    if !admin_logged_in
      redirect_to adminlogin_path
    else
    ##find accounts who has already submitted the applications
    @accounts = Account.where('submit_bcheck =?', true)
---
SELECT "accounts".* FROM "accounts" WHERE (lower(firstname) = 'sikai') AND (lower(lastname) = 'zhang') AND (lower(email) LIKE lower('zhangsikai%'))

  def moreshow
   if !admin_logged_in
      redirect_to adminlogin_path
   else
    @accounts = Account.where('is_volunteering = ?', true)
---
SELECT "accounts".* FROM "accounts" WHERE (is_volunteering=true) AND (lower(email) LIKE lower('%'))

   def approve
    @account = Account.find(params[:id])
    if @account.update_columns(status: true, submit_bcheck: false)
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "accounts" SET "status" = 't', "submit_bcheck" = 'f' WHERE "accounts"."id" = ?  [["id", 1]]

   def reject
     @account = Account.find(params[:id])
    if @account.update_columns(status: false, submit_bcheck: false)
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", 14]]
UPDATE "accounts" SET "status" = 'f', "submit_bcheck" = 'f' WHERE "accounts"."id" = ?  [["id", 1]]