app/controllers/sessions_controller.rb

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."email" = ? LIMIT 1  [["email", "123"]]
---
  def create
   @account = Account.find_by(email: params[:session][:email].downcase)